test/site/content-org/writing-hugo-blog-in-org-file-export.org
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: ./

#+HUGO_WEIGHT: 2001
#+HUGO_AUTO_SET_LASTMOD: t

#+TITLE: Writing Hugo blog in Org (File Export)

#+DATE: 2017-09-10
#+FILETAGS: dont_export_during_make_test
#+HUGO_TAGS: hugo org
#+HUGO_CATEGORIES: emacs
#+HUGO_MENU: :menu "main" :weight 2001
#+HUGO_CUSTOM_FRONT_MATTER: :foo bar :baz zoo :alpha 1 :beta "two words" :gamma 10

#+HUGO_DRAFT: true

* First heading within the post
- This post will be exported as
  =content/posts/writing-hugo-blog-in-org-file-export.md=.
- Its title will be "Writing Hugo blog in Org".
- It will have /hugo/ and /org/ tags and /emacs/ as category.
- The /lastmod/ property in the front-matter is set automatically to
  the time of export.
- The menu item /identifier/ is auto-set.
- The menu item /weight/ and post /weight/ if needed have to be
  manually specified as shown above.
** A sub-heading under that heading
- It's draft state will be marked as =true= because of =#+HUGO_DRAFT:
  true=.

With the point _anywhere_, do =C-c C-e H h= to export this whole file
titled /Writing Hugo blog in Org/ to a Hugo post.

The exported Markdown has a little comment footer as set in the /Local
Variables/ section below.
* Footnotes
* COMMENT Local Variables                                           :ARCHIVE:
# Local Variables:
# fill-column: 70
# eval: (auto-fill-mode 1)
# eval: (add-hook 'after-save-hook #'org-hugo-export-wim-to-md-after-save :append :local)
# org-hugo-footer: "\n\n[//]: # \"Exported with love from a post written in Org mode\"\n[//]: # \"- https://github.com/kaushalmodi/ox-hugo\""
# End:
